ЕРПУХАстенд.cbr_Основной/src/AccumulationRegisters/cbr_ТоварыКПеремещению/cbr_ТоварыКПеремещению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ТоварыКПеремещению</name>
  <comment>//++АшаеваАН 13.02.26 СКЛ.3</comment>
  <resources>
    <name>КоличествоКПеремещению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПТУ</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕРПУХАстенд.cbr_Основной/src/AccumulationRegisters/cbr_ОстаткиНоменклатурыПоСоглашению/cbr_ОстаткиНоменклатурыПоСоглашению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ОстаткиНоменклатурыПоСоглашению</name>
  <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  <resources>
    <name>Количество</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Соглашение</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/cbr_ВидыДвиженияСоглашенияСКлиентами/cbr_ВидыДвиженияСоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ВидыДвиженияСоглашенияСКлиентами</name>
  <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  <enumValues>
    <name>Приход</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  </enumValues>
  <enumValues>
    <name>Расход</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/cbr_ОперацияСоглашения/cbr_ОперацияСоглашения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_ОперацияСоглашения</name>
  <registerRecords>AccumulationRegister.cbr_ОстаткиНоменклатурыПоСоглашению</registerRecords>
  <attributes>
    <name>Соглашение</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>EnumRef.cbr_ВидыДвиженияСоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатура</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2bb5c12e-1217-4c8d-ae01-3a6253cfe429">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>cbr_Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДокументыДляВодителя</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТаможенноеСопровождение</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_УсловияДоставки</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКУпаковке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКЭтикетке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованиеККомплектации</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НеБолееДатыПроизводства</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееПроцент</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееМес</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПрочиеТребования</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_АгентскоеВознаграждение</name>
    <comment>//++ Тусеев ПРД12</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучнаяСкидка</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентТУ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучная</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентАВ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>cbr_АгентскиеВознаграждения</name>
    <comment>//++ Тусеев ПРД12</comment>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорАгента</name>
      <type>
        <types>DocumentRef.ВерсияСоглашенияКоммерческийДоговор</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_ЦеныПоТоварам</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрцентРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикиИспользуются</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_РесурсныеСпецификации</name>
    <attributes>
      <name>РесурснаяСпецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/CommonModules/cbr_УправлениеРегламентнымиЗаданиями/Module.bsl
#Область ПрограммныйИнтерфейс

//++АшаеваАН 13.02.26 СКЛ.3
Процедура cbr_ФормированиеДокументовПеремещенияНаОснованииПТУ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.cbr_ФормированиеДокументовПеремещенияНаОснованииПТУ);
	РегистрыНакопления.cbr_ТоварыКПеремещению.cbr_СформироватьДокументыПеремещенияНаОснованииПТУ();
	
КонецПроцедуры //--АшаеваАН 13.02.26 СКЛ.3

//++AlopinAS 16.02.2026 ПРД20
Процедура cbr_УдалениеЗаписейИзРегистраСоглашенияСКлиентами() Экспорт
	
	//++AlopinAs 170326 ПРД20	
		
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Соглашение КАК Соглашение,
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура КАК Номенклатура,
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика КАК Характеристика,
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.ДатаНачала КАК ДатаНачала,
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|ПОМЕСТИТЬ ВТРегистр
//	|ИЗ
//	|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
//	|ГДЕ
//	|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка КАК Ссылка,
//	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
//	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
//	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
//	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
//	|ПОМЕСТИТЬ ВТСоглашения
//	|ИЗ
//	|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
//	|ГДЕ
//	|	РАЗНОСТЬДАТ(СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания, &ТекущаяДата, ДЕНЬ) > 0
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТРегистр.Соглашение КАК Соглашение,
//	|	ВТРегистр.Номенклатура КАК Номенклатура,
//	|	ВТРегистр.Характеристика КАК Характеристика,
//	|	ВТРегистр.ДатаНачала КАК ДатаНачала,
//	|	ВТРегистр.КоличествоОстаток КАК КоличествоОстаток,
//	|	ВТСоглашения.ДатаОкончания КАК ДатаОкончания
//	|ИЗ
//	|	ВТСоглашения КАК ВТСоглашения
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
//	|		ПО ВТРегистр.Соглашение = ВТСоглашения.Ссылка
//	|		И ВТРегистр.Номенклатура = ВТСоглашения.Номенклатура
//	|		И ВТРегистр.Характеристика = ВТСоглашения.Характеристика
//	|		И ВТРегистр.ДатаНачала = ВТСоглашения.ДатаНачала
//	|ИТОГИ
//	|	МАКСИМУМ(Соглашение)
//	|ПО
//	|	ДатаНачала,
//	|	ДатаОкончания";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Соглашение КАК Соглашение,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Номенклатура КАК Номенклатура,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.Характеристика КАК Характеристика,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.ДатаНачала КАК ДатаНачала,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТРегистр
		|ИЗ
		|	РегистрНакопления.cbr_ОстаткиНоменклатурыПоСоглашению.Остатки КАК cbr_ОстаткиНоменклатурыПоСоглашениюОстатки
		|ГДЕ
		|	cbr_ОстаткиНоменклатурыПоСоглашениюОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка КАК Ссылка,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания,
		|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТСоглашения
		|ИЗ
		|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
		|ГДЕ
		|	РАЗНОСТЬДАТ(СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания, &ТекущаяДата, ДЕНЬ) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРегистр.Соглашение КАК Соглашение,
		|	ВТРегистр.Номенклатура КАК Номенклатура,
		|	ВТРегистр.Характеристика КАК Характеристика,
		|	ВТРегистр.ДатаНачала КАК ДатаНачала,
		|	ВТРегистр.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТСоглашения.ДатаОкончания КАК ДатаОкончания,
		|	ВТРегистр.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТСоглашения КАК ВТСоглашения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРегистр КАК ВТРегистр
		|		ПО ВТРегистр.Соглашение = ВТСоглашения.Ссылка
		|		И ВТРегистр.Номенклатура = ВТСоглашения.Номенклатура
		|		И ВТРегистр.Характеристика = ВТСоглашения.Характеристика
		|		И ВТРегистр.ЕдиницаИзмерения = ВТСоглашения.ЕдиницаИзмерения
		|		И ВТРегистр.ДатаНачала = ВТСоглашения.ДатаНачала
		|ИТОГИ
		|	МАКСИМУМ(Соглашение)
		|ПО
		|	ДатаНачала,
		|	ДатаОкончания";
	
	//--AlopinAs 170326 ПРД20	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДатаНачала = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДокументовДляПроведения = Новый Массив();
	
	Пока ВыборкаДатаНачала.Следующий() Цикл

		ВыборкаДатаОкончания = ВыборкаДатаНачала.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаДатаОкончания.Следующий() Цикл
			
			НовыйДокумент = Документы.cbr_ОперацияСоглашения.СоздатьДокумент();
			НовыйДокумент.Дата = ВыборкаДатаОкончания.ДатаНачала;
			НовыйДокумент.Соглашение = ВыборкаДатаОкончания.Соглашение;
			НовыйДокумент.Действие = ПредопределенноеЗначение("Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Расход");
			
			НовыйДокумент.ДатаОкончания = ВыборкаДатаОкончания.ДатаОкончания;
			
			ДанныеДляФормирования = ВыборкаДатаОкончания.Выбрать();

			Пока ДанныеДляФормирования.Следующий() Цикл
				Новаястрока = НовыйДокумент.СписокНоменклатура.Добавить();
				ЗаполнитьЗначенияСвойств(Новаястрока, ДанныеДляФормирования);
				
				Новаястрока.Количество = ДанныеДляФормирования.КоличествоОстаток;
			КонецЦикла;
			МассивДокументовДляПроведения.Добавить(НовыйДокумент);
		КонецЦикла;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка 
		Для Каждого Документ Из МассивДокументовДляПроведения Цикл
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Ошибка создания документа операции по соглашению! Подробности смотри в журнале регистрации.'");
		ЗаписьЖурналаРегистрации("ОшибкаСозданияОперацииСоглашения", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Документы.cbr_ОперацияСоглашения, , ТекстСообщения + ОписаниеОшибки(),
			РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
		
КонецПроцедуры //--AlopinAS 16.02.2026 ПРД20
#КонецОбласти
